#+TITLE: Org Mode Table Tutorial
#+AUTHOR: James Stoup
#+DATE: <2025-01-23 Thu>

* Welcome to Table Madness 
Understanding Org Tables can be one of the more frustrating parts of advanced Org Mode usage. The concepts seem simple, but applying them to produce useful results can often be quite challenging. The devil, as they say, is in the details. The official documentation is often a bit hard to understand and teasing out complex behavior from the core rules can often leave less experienced users giving up in frustration. To make using tables easier I've created this tutorial, which serves as a huge cheat sheet for the most common operations as well as a reference for more complex formulas.

* Org Table Basics 
If you haven't already, check out the [[https://orgmode.org/worg/org-tutorials/tables.html][offical Org Mode Tables documentation]] to get a good overview of how tables work. 




** Identifying Table Cells
Org mode uses the ~@~ symbol to denote rows and the ~$~ symbol to denote columns. As you see here:

| @1 $1 | @1 $2 | @1 $3 |
| @2 $1 | @2 $2 | @2 $3 |
| @3 $1 | @3 $2 | @3 $3 |


** Creating Formulas
Create a formula by adding this to be end of any table ~#+TBLFM: <insert formula here>~

Here is a simple example. The formula should be read as "column 2 equals column 1 multiplied by 3"

#+begin_src org
| 1 |  3 |
| 2 |  6 |
| 3 |  9 |
| 4 | 12 |
| 5 | 15 |
#+TBLFM: $2=$1*3
#+end_src

This is as simple as an example as you will find. No headers, no complex functions, just a little bit of multiplication. 

* Common Tasks
There are quite a few common functions that your average user will frequently need. Numbering a list, summing up a column of numbers, etc. This section provides tables, formulas, and explanations as we walk through how to achieve the desired results.

** Auto Incrementing
Let's assume that you are keeping track of books you wish to read in a table. You want to record the book's name, whether or not you've read it, and you want a running count of the books in the table. Of course you could manually enter 1,2,3,etc. but that is tedious. A better way is to have a formula to automatically generate the indexes.

#+begin_src org
|   | BOOKS             | READ? |
|   | IT                | yes   |
|   | The Hobbit        | yes   |
|   | The Black Company | yes   |
|   | Salem's Lot       | no    |
|   | Leaves of grass   | no    |
#+end_src

A naive attempt would be to set the value of the first column equal to number of the row. That produces this output:

#+begin_src org
| 1 | BOOKS             | READ? |
| 2 | IT                | yes   |
| 3 | The Hobbit        | yes   |
| 4 | The Black Company | yes   |
| 5 | Salem's Lot       | no    |
| 6 | Leaves of grass   | no    |
#+TBLFM: $1=@#
#+end_src

And while that works, that isn't really want we want. Having the first index start at the title row is not how we want this to operate. Let's add a separator by adding ~|--~ to the second line and hitting the ~tab~ key. 

#+begin_src org
|   | BOOKS             | READ? |
|---+-------------------+-------|
| 2 | IT                | yes   |
| 3 | The Hobbit        | yes   |
| 4 | The Black Company | yes   |
| 5 | Salem's Lot       | no    |
| 6 | Leaves of grass   | no    |
#+TBLFM: $1=@#
#+end_src

This is looking better! The formula is smart enough to know that we don't want to include something before the separator. However, it still isn't correct. Even though it didn't show the first value, it still incremented it, which leaves our starting value at 2. We can do better. Modify the formula to subtract one from each value to produce the result we want.

#+begin_src org
|   | BOOKS             | READ? |
|---+-------------------+-------|
| 1 | IT                | yes   |
| 2 | The Hobbit        | yes   |
| 3 | The Black Company | yes   |
| 4 | Salem's Lot       | no    |
| 5 | Leaves of grass   | no    |
#+TBLFM: $1=@#-1
#+end_src

** Sorting By Column
It is often very useful to sort a table by a column. Take the table we have below. It contains a list of NFL QB stats. 

#+begin_src org
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS |
|----------------+------+---------------+---------------|
| Joe Burrow     | 69.8 |          4641 |           202 |
| Lamar Jackson  | 67.9 |          3955 |           852 |
| Josh Allen     | 63.6 |          3731 |           531 |
| Jayden Daniels | 69.4 |          3530 |           864 |
#+end_src

Let's start with something simple such as sorting the players by name. Navigate to the first column and put your cursor on any one of the four lines containing a player name. If your cursor is on the horizontal line or the column title it won't sort. In this case I'm going to put my cursor on the record with ~Lamar Jackson~ and then type ~C-c ^~ to invoke ~org-sort~. In the mini buffer you will see this message:

~Sort Table: [a]lphabetic, [n]umeric, [t]ime, [f]unc. A/N/TF means reversed:~

Which gives you the sorting options. Since we want the names alphabetized type ~a~ and it produces this:

#+begin_src org
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS |
|----------------+------+---------------+---------------|
| Jayden Daniels | 69.4 |          3530 |           864 |
| Joe Burrow     | 69.8 |          4641 |           202 |
| Josh Allen     | 63.6 |          3731 |           531 |
| Lamar Jackson  | 67.9 |          3955 |           852 |
#+end_src

Which is what we wanted! How about if we wanted to sort them by ~PASSING YARDS~? Then we do the same thing only we execute ~org-sort~ from the 3rd column and select ~N~ to produce this:

#+begin_src org
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS |
|----------------+------+---------------+---------------|
| Joe Burrow     | 69.8 |          4641 |           202 |
| Lamar Jackson  | 67.9 |          3955 |           852 |
| Josh Allen     | 63.6 |          3731 |           531 |
| Jayden Daniels | 69.4 |          3530 |           864 |
#+end_src

The order is reversed because we want the most yards as the first record.

** Summing a Column
You have started a side business going to estate sales, purchasing old items cheaply, and then reselling them for a profit. To keep track of your business you have started entering everything in a handy org table. Now you have sold five items and you want to see how your balance sheet looks. So, let's start by doing a vector sum on your costs to see how much you spent. Here is the obvious way to do do this:

#+begin_src org
| ITEM   | COST | PRICE |
|--------+------+-------|
| Bike   |   50 |   100 |
| Sword  |   20 |    35 |
| Drill  |   30 |    60 |
| Cooler |   10 |    70 |
| TV     |   50 |    40 |
|--------+------+-------|
|        |  160 |       |
,#+TBLFM: @7$2=vsum(@2..@6)
#+end_src

This works as a first attempt, but it isn't ideal. What if we add another item? That presents a problem. If you buy a blender for 25 and sell it for 45, then execute the same formula, you get this:

#+begin_src org
| ITEM    | COST | PRICE |
|---------+------+-------|
| Bike    |   50 |   100 |
| Sword   |   20 |    35 |
| Drill   |   30 |    60 |
| Cooler  |   10 |    70 |
| TV      |   50 |    40 |
| Blender |  160 |    45 |
|---------+------+-------|
|         |      |       |
,#+TBLFM: @7$2=vsum(@2..@6)
#+end_src

The formula still wants to write the value into the 7th row, however the 7th row is no longer the last row. Thus the cost value was overwritten. This is not what we want. We need a way to tell the formula to always write to the last line, regardless of how many lines are in the table. What we need is the ~@>~ operator, that signifies the last row of the table.

#+begin_src org
| ITEM    | COST | PRICE |
|---------+------+-------|
| Bike    |   50 |   100 |
| Sword   |   20 |    35 |
| Drill   |   30 |    60 |
| Cooler  |   10 |    70 |
| TV      |   50 |    40 |
| Blender |   25 |    45 |
| Boots   |   10 |    20 |
|---------+------+-------|
|         |  160 |       |
#+TBLFM: @>$2=vsum(@2..@6)
#+end_src

The good news is that nothing got overwritten and our sum got correctly added to the last line. The bad news is that our new values aren't being added. The output is dynamic, but the input is locked in at the first four values with ~@2..@6~ which doesn't work as our table expands. We need the input to be dynamic too. To achieve that we can change the lower bound to be ~@-1~ so that the correct values are used. Now we have a much more usable formula for calculating costs.

What we need now is a formula for summing up the ~PRICE~ column. We could just create another formula line, increment a column value, and then execute both lines, but there is a cleaner solution. Let's tell org mode to sum up all the columns!


#+begin_src org
| ITEM    | COST | PRICE |
|---------+------+-------|
| Bike    |   50 |   100 |
| Sword   |   20 |    35 |
| Drill   |   30 |    60 |
| Cooler  |   10 |    70 |
| TV      |   50 |    40 |
| Blender |   25 |    45 |
| Boots   |   20 |    20 |
|---------+------+-------|
|         |  205 |       |
#+TBLFM: @>$2=vsum(@2..@-1)
#+end_src

By using the ~@>~ operator we can tell org mode to reference the entire last row. Let's see how this works.

#+begin_src org
| ITEM                                                 | COST | PRICE |
|------------------------------------------------------+------+-------|
| Bike                                                 |   50 |   100 |
| Sword                                                |   20 |    35 |
| Drill                                                |   30 |    60 |
| Cooler                                               |   10 |    70 |
| TV                                                   |   50 |    40 |
| Blender                                              |   25 |    45 |
| Boots                                                |   20 |    20 |
|------------------------------------------------------+------+-------|
| Bike + Sword + Drill + Cooler + TV + Blender + Boots |  205 |   370 |
#+TBLFM: @>=vsum(@2..@-1)
#+end_src

Hmmmm. This is not exactly what we want. Unintended consequences are the hallmark of org tables, thankfully this is an easy fix. By restricting the output to the range ~$2..$3~ we get a much nicer table! Perfect, right?


#+begin_src org
| ITEM    | COST | PRICE |
|---------+------+-------|
| Bike    |   50 |   100 |
| Sword   |   20 |    35 |
| Drill   |   30 |    60 |
| Cooler  |   10 |    70 |
| TV      |   50 |    40 |
| Blender |   25 |    45 |
| Boots   |   20 |    20 |
|---------+------+-------|
|         |  205 |   370 |
#+TBLFM: @>$2..$3=vsum(@2..@-1)
#+end_src

Everything should be great unless we need to add another column or two.

#+begin_src org
| ITEM    | COST | PRICE | SHIPPING | MILEAGE |
|---------+------+-------+----------+--------|
| Bike    |   50 |   100 |        0 |     23 |
| Sword   |   20 |    35 |       10 |     12 |
| Drill   |   30 |    60 |        5 |     51 |
| Cooler  |   10 |    70 |        0 |     32 |
| TV      |   50 |    40 |       20 |     19 |
| Blender |   25 |    45 |        0 |      9 |
| Boots   |   20 |    20 |        0 |     38 |
|---------+------+-------+----------+--------|
|         |  205 |   370 |          |        |
,#+TBLFM: @>$2..$3=vsum(@2..@-1)
#+end_src

Well that's not going to work. Now we need to make the amount of columns dynamic too. We can achieve this by replacing the previous bound on the output of ~$3~ with ~$>~, the "last column" operator. Now it doesn't matter how many columns we add in the future, it will just work.

#+begin_src org
| ITEM    | COST | PRICE | SHIPPING | MILEAGE |
|---------+------+-------+----------+--------|
| Bike    |   50 |   100 |        0 |     23 |
| Sword   |   20 |    35 |       10 |     12 |
| Drill   |   30 |    60 |        5 |     51 |
| Cooler  |   10 |    70 |        0 |     32 |
| TV      |   50 |    40 |       20 |     19 |
| Blender |   25 |    45 |        0 |      9 |
| Boots   |   20 |    20 |        0 |     38 |
|---------+------+-------+----------+--------|
|         |  205 |   370 |       35 |    184 |
#+TBLFM: @>$2..$>=vsum(@2..@-1)
#+end_src

Doesn't that look much better?

** Summing a Row
Now that we know how to sum up column data we can move on to rows. Let's use the previous table of NFL QBs and calculate who had the most yards total.

#+begin_src org
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS | TOTAL YARDS |
|----------------+------+---------------+---------------+-------------|
| Joe Burrow     | 69.8 |          4641 |           202 |        4843 |
| Lamar Jackson  | 67.9 |          3955 |           852 |        4807 |
| Josh Allen     | 63.6 |          3731 |           531 |        4262 |
| Jayden Daniels | 69.4 |          3530 |           864 |        4394 |
#+TBLFM: @2$5=@2$3+@2$4
#+TBLFM: @3$5=@3$3+@3$4
#+TBLFM: @4$5=@4$3+@4$4
#+TBLFM: @5$5=@5$3+@5$4
#+end_src

Perfect! It only took four different formulas, all with nearly identical values, executed four times, to produce what we want. So maybe this isn't the most efficient approach, but it does work. Sort of. Fine, let's try to make it better. Let's start by getting rid of the duplication. First, we need stop manually entering the output bounds. Just designate the 5th column to be the output.

#+begin_src org
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS | TOTAL YARDS |
|----------------+------+---------------+---------------+-------------|
| Joe Burrow     | 69.8 |          4641 |           202 |        4843 |
| Lamar Jackson  | 67.9 |          3955 |           852 |        4843 |
| Josh Allen     | 63.6 |          3731 |           531 |        4843 |
| Jayden Daniels | 69.4 |          3530 |           864 |        4843 |
#+TBLFM: $5=@2$3+@2$4
#+end_src

That is certainly simpler, but now all the output values are the same. Since we are calculating the output for each row, we can get rid of the row specifiers in the input. Let's try that and see how that looks.

#+begin_src org
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS | TOTAL YARDS |
|----------------+------+---------------+---------------+-------------|
| Joe Burrow     | 69.8 |          4641 |           202 |        4843 |
| Lamar Jackson  | 67.9 |          3955 |           852 |        4807 |
| Josh Allen     | 63.6 |          3731 |           531 |        4262 |
| Jayden Daniels | 69.4 |          3530 |           864 |        4394 |
#+TBLFM: $5=$3+$4
#+end_src

Much better! Let's add some more columns. 

#+begin_src org
|----------------+------+---------------+---------------+-------------+-------------+-------------+-----------|
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS | TOTAL YARDS | PASSING TDs | RUSHING TDs | TOTAL TDs |
|----------------+------+---------------+---------------+-------------+-------------+-------------+-----------|
| Joe Burrow     | 69.8 |          4641 |           202 |        4843 |          42 |           2 |           |
| Lamar Jackson  | 67.9 |          3955 |           852 |        4807 |          39 |           4 |           |
| Josh Allen     | 63.6 |          3731 |           531 |        4262 |          28 |          12 |           |
| Jayden Daniels | 69.4 |          3530 |           864 |        4394 |          25 |           6 |           |
|----------------+------+---------------+---------------+-------------+-------------+-------------+-----------|
,#+TBLFM: $5=$3+$4
#+end_src

Now that we have each QBs passing and rushing TDs, we need to calculate their total TDs.

|----------------+------+---------------+---------------+-------------+-------------+-------------+-----------|
| PLAYER         | CMP% | PASSING YARDS | RUSHING YARDS | TOTAL YARDS | PASSING TDs | RUSHING TDs | TOTAL TDs |
|----------------+------+---------------+---------------+-------------+-------------+-------------+-----------|
| Joe Burrow     | 69.8 |          4641 |           202 |        4843 |          42 |           2 |        44 |
| Lamar Jackson  | 67.9 |          3955 |           852 |        4807 |          39 |           4 |        43 |
| Josh Allen     | 63.6 |          3731 |           531 |        4262 |          28 |          12 |        40 |
| Jayden Daniels | 69.4 |          3530 |           864 |        4394 |          25 |           6 |        31 |
|----------------+------+---------------+---------------+-------------+-------------+-------------+-----------|
#+TBLFM: $5=$3+$4
#+TBLFM: $8=$6+$7

These two formulas could be written on one line like this:

~#+TBLFM: $5=$3+$4 :: $8=$6+$7~

However I'm putting each formula on a different line so you can easily see the result of each call.


* Formulas Using Built-In Functions 

** Computations on Multiple Cells
Here is a simple enough task. The field marked ~AVERAGE GRADE~ should contain an average of the 3 tests and the final exam grades. The ~CLASS GRADE~ is computed similarly but the final exam is now weighted in respect to the other grades. To generate the averages go to the first formula and execute ~C-c C-c~. To generate the class grade, do the same thing on the second formula.

| STUDENT | TEST 1 | TEST 2 | TEST 3 | FINAL EXAM | AVERAGE GRADE | CLASS GRADE |
|---------+--------+--------+--------+------------+---------------+-------------|
| Alice   |     89 |     93 |     75 |         77 |          83.5 |        82.2 |
| Bob     |     78 |     99 |     69 |         80 |          81.5 |        81.2 |
| Cathy   |     91 |     90 |     90 |         75 |          86.5 |        84.2 |
| Doug    |     48 |     90 |     85 |         82 |         76.25 |        77.4 |
#+TBLFM: $6=vmean($2..$5)
#+TBLFM: $7=($2+$3+$4+(2*$5))/5



** Averaging Values 


* Complex Formulas

* Trickery, Magic, and Other Hacks




